app/controllers/accounts_controller.rb

SELECT * FROM "accounts" WHERE ("accounts"."id" = 10)
---
  def edit
    @account = Account.find(params[:id])

SELECT * FROM "accounts" ORDER BY name
---
  def index
    @accounts = Account.all(:order => "name")

SELECT * FROM "accounts" WHERE ("accounts"."id" = 7)
SELECT * FROM "employees" WHERE ("employees"."account_id" = '15') ORDER BY last_name, first_name
---
  def show
    @account = Account.find(params[:id])
    @employees = Employee.find_all_by_account_id(params[:id], :order => "last_name, first_name")

INSERT INTO "accounts" ("name", "created_at", "updated_at", "bank_name") VALUES('test', '2010-11-12 16:19:06', '2010-11-12 16:19:06', NULL)
---
  def create
    @account = Account.new(params[:account])
    if(@account.save)

SELECT * FROM "accounts" WHERE ("accounts"."id" = 7)
UPDATE "accounts" SET "updated_at" = '2010-11-19 15:16:05', "bank_name" = 'grete' WHERE "id" = 1
---
  def update
    @account = Account.find(params[:id])
    if @account.update_attributes(params[:account])

SELECT * FROM "accounts" WHERE ("accounts"."id" = 8)
SELECT * FROM "employees" WHERE ("employees"."account_id" = '7')
DELETE FROM "accounts" WHERE "id" = 8
---
  def destroy
    @account = Account.find(params[:id])
    Employee.find_all_by_account_id(params[:id]).each { |i|
      i.destroy
    }
    @account.destroy