app/controllers/employees_controller.rb

SELECT * FROM "employees" WHERE ("employees"."id" = 1 AND ("employees".account_id = 1))
---
  def edit
    @employee = @account.employees.find(params[:id])

INSERT INTO "employees" ("created_at", "updated_at", "account_id", "salary", "last_name", "first_name") VALUES('2010-11-12 21:52:50', '2010-11-12 21:52:50', NULL, NULL, '', '')
---
  def create
    @employee = @account.employees.new(params[:employee])
    if(@employee.save)

SELECT * FROM "employees" WHERE ("employees"."id" = 1 AND ("employees".account_id = 1))
UPDATE "employees" SET "updated_at" = '2010-11-13 02:17:45', "salary" = 32, "last_name" = 'bb', "first_name" = 'as' WHERE "id" = 27
---
  def update
    @employee = @account.employees.find(params[:id])
    if @employee.update_attributes(params[:employee])

DELETE FROM "employees" WHERE "id" = 23
SELECT * FROM "employees" WHERE ("employees"."id" = 1 AND ("employees".account_id = 1))
---
  def destroy
    @employee = @account.employees.find(params[:id]).destroy

SELECT * FROM "accounts" WHERE ("accounts"."id" = 23)
---
  def find_account
    @account = Account.find(params[:account_id])